[{"_path":"/blog/importance_california_cmsp_safe_riding","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"R.I.D.E. Right: The Importance of California's CMSP for Safe Riding","description":"Within the motorcycle community, safety is paramount, and California has taken significant strides through the California Motorcyclist Safety Program (CMSP) to ensure riders are equipped with the necessary skills and knowledge. This initiative is more than just a safety course; it's a comprehensive approach to fostering responsible and skilled riders with what is known as the R.I.D.E. Right framework—Responsible, Informed, Disciplined, and Equipped.","_type":"markdown","_id":"content:blog:importance_california_cmsp_safe_riding.md","_source":"content","_file":"blog/importance_california_cmsp_safe_riding.md","_stem":"blog/importance_california_cmsp_safe_riding","_extension":"md","sitemap":{"loc":"/blog/importance_california_cmsp_safe_riding"}},{"_path":"/blog/mapping-your-way-to-safer-motorcycling-across-the-us","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Mapping Your Way to Safer Motorcycling Across the U.S.","description":"Motorcycling is as much about the journey as the destination. But to ensure that these journeys remain safe and enjoyable, training is paramount. Across the United States, numerous organizations are committed to educating riders on safe practices and honing their skills. Programs like the California Motorcyclists Safety Program (CMSP), Motorcycle Safety Foundation (MSF), and others have developed extensive networks of training locations. This article highlights the importance of these training sites and the benefits they offer to motorcyclists across the nation.","_type":"markdown","_id":"content:blog:mapping-your-way-to-safer-motorcycling-across-the-us.md","_source":"content","_file":"blog/mapping-your-way-to-safer-motorcycling-across-the-us.md","_stem":"blog/mapping-your-way-to-safer-motorcycling-across-the-us","_extension":"md","sitemap":{"loc":"/blog/mapping-your-way-to-safer-motorcycling-across-the-us"}}]